:PROPERTIES:
:ID:       69387d42-c46e-4b17-808c-f20a558f8291
:END:
#+title: python-DataStructure
#+startup: overview
#+filetags: :python:DataStructure:

** 定义
#+begin_src plaintext
列表序列名称 = [列表中的元素1, 列表中的元素2, 列表中的元素3, ...]

注意: 列表是可变的
#+end_src
#+begin_src python :results output
fruit_list = ['orange', 'grape', 'mango']
# list列表类型支持直接打印
print(fruit_list)
# 打印列表的数据类型
print(type(fruit_list))  # <class 'list'>
#+end_src

#+RESULTS:
: ['orange', 'grape', 'mango']
: <class 'list'>

** 具体例子
#+begin_src python :results output
name_list = ['hello', 'apple', 'bike', 'back', 'bike']
# index
index = name_list.index('apple')
print(index)
# count
count = name_list.count('bike')
print(count)
# in and not in
print('apple' in name_list)
print('hack' not in name_list)
# append
if 'hack' not in name_list:
    name_list.append('hack')
print(name_list)
# extend
name_list2 = ['fruit', 'hike']
name_list.extend(name_list2)
print(name_list)
# insert
name_list.insert(0, 'xiaoming')
print(name_list)
# del
del name_list[1]
print(name_list)
# pop
pop_name = name_list.pop()
print(pop_name)
print(name_list)
# remove
name_list.remove('apple')
print(name_list)
# []
name_list[0] = 'xiaohong'
print(name_list)
# reverse
name_list.reverse()
print(name_list)
# sort
# NOTE: reverse=True(倒序) False(默认,正序)
name_list.sort(reverse=True)
print(name_list)
name_list.sort()
print(name_list)
#+end_src

#+RESULTS:
#+begin_example
1
2
True
True
['hello', 'apple', 'bike', 'back', 'bike', 'hack']
['hello', 'apple', 'bike', 'back', 'bike', 'hack', 'fruit', 'hike']
['xiaoming', 'hello', 'apple', 'bike', 'back', 'bike', 'hack', 'fruit', 'hike']
['xiaoming', 'apple', 'bike', 'back', 'bike', 'hack', 'fruit', 'hike']
hike
['xiaoming', 'apple', 'bike', 'back', 'bike', 'hack', 'fruit']
['xiaoming', 'bike', 'back', 'bike', 'hack', 'fruit']
['xiaohong', 'bike', 'back', 'bike', 'hack', 'fruit']
['fruit', 'hack', 'bike', 'back', 'bike', 'xiaohong']
['xiaohong', 'hack', 'fruit', 'bike', 'bike', 'back']
['back', 'bike', 'bike', 'fruit', 'hack', 'xiaohong']
#+end_example

** 列表遍历
#+begin_src python :results output
# while
star_list = ['西施', '王昭君', '杨玉环']
i = 0
while i < len(star_list):
    print(star_list[i])
    i += 1
print(100 * '#')
# for
for star in star_list:
    print(star)
#+end_src

#+RESULTS:
: 西施
: 王昭君
: 杨玉环
: ####################################################################################################
: 西施
: 王昭君
: 杨玉环
** 列表嵌套
#+begin_src python :results output
# 演示 列表嵌套
# 说明: 容器内部嵌套容器方式
# 需求: 有 三个班级, 分别为 前端1班 前端2班  后端1班, 每个班级分别有5位学生
# 定义 班级列表
front1_class = ['小明','小红','小刚','小丽','小强']
front2_class = ['小芳','小亮','小宇','小浩','小琪']
back1_class = ['小诺','小泽','小琳','小航','小彤']

# 定义 学校列表, 学校列表中有三个班级
school_list = [front1_class,front2_class,back1_class]

# 以上内容 如果直接使用列表嵌套写法
school_list = [
    ['小明','小红','小刚','小丽','小强'],
    ['小芳','小亮','小宇','小浩','小琪'],
    ['小诺','小泽','小琳','小航','小彤']
]

# 如何 获取里面的数据呢?  比如 我想获取到 小浩
front2_class = school_list[1]
name = front2_class[3]
print(name)

# 可以简写
name = school_list[1][3]
print(name)

# 如何遍历打印每一个元素
for classes in school_list:
    for name in classes:
        print(name)
    print("-----------")
#+end_src

#+RESULTS:
#+begin_example
小浩
小浩
小明
小红
小刚
小丽
小强
-----------
小芳
小亮
小宇
小浩
小琪
-----------
小诺
小泽
小琳
小航
小彤
-----------
#+end_example

** 定义
#+begin_src python :results output
# 1- 如何定义集合
# 格式:
#       格式一:  变量名称 = {元素1,元素2,元素3......}
#       格式二:  变量名称 = set()   空集合
# 特性: 无序 + 去重
# 定义一个有内容的集合
name_set = {'小明','小红','小刚','小明','小刚','小丽'}

print(name_set) #  去重 和 无序  发现每次都是不一样的 所以是无序的
print(type(name_set))
# 定义 空集合
# set2 = {}  # 此种定义方法 并不是定义空集合, 而是空的字典
empty_set = set()
print(type(empty_set))

# 获取数据: 遍历的方式
# for 循环
for name in name_set:
    print(name)
#+end_src

#+RESULTS:
: {'小明', '小红', '小刚', '小丽'}
: <class 'set'>
: <class 'set'>
: 小明
: 小红
: 小刚
: 小丽

*** 查
#+begin_src python :results output
name_set = {'小明','小红','小刚'}
name_set.add('小强')
print(name_set)
#+end_src

#+RESULTS:
: {'小强', '小明', '小刚', '小红'}

*** 删
#+begin_src python :results output
name_set = {'小明','小红','小刚'}
name_set.remove('小红')
print(name_set)
#+end_src

#+RESULTS:
: {'小明', '小刚'}

** 示例
#+begin_src python :results output
num_set = {3, 4, 'xiaoming', False, True}
num_set.add('hello')
print(num_set)
num_set.remove('xiaoming')
print(num_set)
if 'xiaoming' not in num_set:
    num_set.add('xiaoming')

# NOTE: 集合自己会去重
num_set.add(10)
num_set.add(10)
num_set.add(10)
num_set.add(10)
num_set.add(10)
num_set.add(10)
num_set.add(10)
num_set.add(10)
num_set.add(10)
num_set.add(10)
num_set.add(10)
print(num_set)
#+end_src

#+RESULTS:
: {False, True, 3, 4, 'xiaoming', 'hello'}
: {False, True, 3, 4, 'hello'}
: {False, True, 3, 4, 'xiaoming', 'hello', 10}

** 定义
#+begin_src python :results output
# 1- 演示: 如何定义字典
# 格式:
#   格式1:  变量名称 = {key1:value1,key2:value2,key3:value3.....}
#   格式2:  变量名称 = {}  或者 变量名称 = dict()   空字典

# 构建一个有内容的字典
person = {'name': '小明', 'age': 19, 'address': "上海市浦东新区张江镇", 'sex': '男', 'hobby': '篮球、足球、游泳'}
print(person)
print(type(person))

# 构建空字典
dict1 = {}
dict2 = dict()
print(dict1)
print(type(dict1))
print(dict2)
print(type(dict2))

# 遍历操作
for key in person:
    print(key)
    print(person[key])
#+end_src

#+RESULTS:
#+begin_example
{'name': '小明', 'age': 19, 'address': '上海市浦东新区张江镇', 'sex': '男', 'hobby': '篮球、足球、游泳'}
<class 'dict'>
{}
<class 'dict'>
{}
<class 'dict'>
name
小明
age
19
address
上海市浦东新区张江镇
sex
男
hobby
篮球、足球、游泳
#+end_example

*** 删
#+begin_src python :results output
person = {'name': '小明', 'age': 19}
del person['age']
print(person)
#+end_src

#+RESULTS:
: {'name': '小明'}

#+begin_src python :resuts output
person = {'name': '小明', 'age': 19}
person.clear()
print(person)
#+end_src

#+RESULTS:
: None

** 字符串格式化
#+begin_src python :results output
print ( "My name is %s and weight is %d kg!" % ('Zara', 21) ) 
#+end_src

#+RESULTS:
: My name is Zara and weight is 21 kg!
